In [1]:
from climber_class import *

### We have 3 types of data:
- Independent features (clustered)
- How good the route is (the higher the better)
- `Grade, Location, sex, heigh (defined by user)` => <b>In this notebook we will work on this one

# User

We need to create a user with this same route features
- Grade
- Location
- Cluster
- Heigh
- Sex

#### Climber atributes

In [2]:
climber_1 = climber('jordi',44,3,['rum','eidas','ajs niod'],165,1)
climber_2 = climber()
display(climber_1.get_data())
display(climber_2.get_data())

   climber_id   name  grade  grade_range country   crag    sector  height  sex
0           0  jordi     44            3     rum  eidas  ajs niod     165    1

,climber_id,name,grade,grade_range,country,crag,sector,height,sex
0,1,climber1,54,2,esp,montserrat,agulla del senglar,170,0

In [3]:
climber_1.set_attributes(grade = 29)
climber_2.set_attributes(grade_range = 1)
display(climber_1.get_data())
display(climber_2.get_data())

   climber_id   name  grade  grade_range country   crag    sector  height  sex
0           0  jordi     29            3     rum  eidas  ajs niod     165    1

,climber_id,name,grade,grade_range,country,crag,sector,height,sex
0,1,climber1,54,1,esp,montserrat,agulla del senglar,170,0

#### For routes

In [4]:
routes = pd.read_csv('../data/routes_clustered.csv',low_memory=False, index_col=0)

In [5]:
climber_1.add_route_liked(routes.iloc[[13403]])
climber_1.add_route_not_liked(routes.tail(2))
climber_1.add_route(routes.head(1))
display("Routes liked:",climber_1.get_routes_liked())
print()
print()
display("Routes not liked:",climber_1.get_routes_climbed())

'Routes liked:'

,name_id,country,name,crag,sector,ascents_count,grade_median,comment_count,rating_mean,repeat_count,recommend_count,tall_recommend,sentiment_count,sex_ratio,cluster
13403,13403,esp,sanson jun zan,baltzola,barnekaldea,20,59.0,8,1.6,0.0,3.0,0,1.135763,0.05,2

'Routes not liked:'

,name_id,country,name,crag,sector,ascents_count,grade_median,comment_count,rating_mean,repeat_count,recommend_count,tall_recommend,sentiment_count,sex_ratio,cluster
13403,13403,esp,sanson jun zan,baltzola,barnekaldea,20,59.0,8,1.600000,0.0,3.0,0,1.135763,0.050000,2
0,0,arg,barba roja,el trebol,pared blanca,11,48.5,3,1.535714,0.0,3.0,0,0.000000,0.090909,0
38719,38719,zaf,rooi haaksteene,sanddrif,main wall,4,49.0,3,2.500000,0.0,0.0,0,1.273500,0.000000,0
38720,38720,zaf,wow wow peddle,sanddrif,main wall,12,38.0,6,2.666667,2.0,0.0,0,2.749800,0.166667,0

#### For clusters

In [7]:
climber_1.cluster

[-2, 0, 1, 0, 0, 0, 0, 0, 0]

In [8]:
climber_1.get_cluster_order()

[2, 1, 3, 4, 5, 6, 7, 8, 0]

In [12]:
climber_1.add_route_liked(routes.head(1346456))

In [13]:
climber_1.cluster

[30575, 232, 4224, 114, 2051, 432, 194, 868, 31]

In [14]:
climber_1.get_cluster_order()

[0, 2, 4, 7, 5, 1, 6, 3, 8]

In [15]:
climber_1.clear_routes()
display(climber_1.get_routes_climbed())

Empty DataFrame
Columns: [name_id, country, name, crag, sector, ascents_count, grade_median, comment_count, rating_mean, repeat_count, recommend_count, tall_recommend, sentiment_count, sex_ratio, cluster]
Index: []